<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"9bb50083289f457943ea5fcaaae62cf527dbdc3d3a6634de812d30bea3ba7ded","plan_job_ref":"Job Test plan target and replace #347 at https://github.com/dflook/terraform-github-actions/actions/runs/5391053569","plan_hash":"88cc12fb02368781c884da4ff1b2dd91891a413a26f4855f590ac5cd0467fb61","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "smJsMTcC8O" -> (known after apply)
  ~ foreach = "Ordtdo6GMQ" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #347](https://github.com/dflook/terraform-github-actions/actions/runs/5391053569)